In [154]:

###KNN
import pandas as pd 
dict={ 'name':["ajay","mark","sara","zaira","sachin","rahul","pooja","smith","laxmi","michael"],
     'age':[32,40,16,34,55,40,20,15,55,15],
     'gender':[0,0,1,1,0,0,1,0,1,0],
      'sport':["football","neither","cricket","cricket","neither","cricket","neither","cricket","football","football"]
     }
df=pd.DataFrame(dict)

print(df)

      name  age  gender     sport
0     ajay   32       0  football
1     mark   40       0   neither
2     sara   16       1   cricket
3    zaira   34       1   cricket
4   sachin   55       0   neither
5    rahul   40       0   cricket
6    pooja   20       1   neither
7    smith   15       0   cricket
8    laxmi   55       1  football
9  michael   15       0  football

In [155]:
find={'name':["angelina"],
     'age':[5],
     'gender':[1],'sport':["?"]}
df1=pd.DataFrame(find)
print(df1)

       name  age  gender sport
0  angelina    5       1     ?

In [156]:
import numpy as np
import math
age_column = df.loc[:,'age']
age = age_column.values
print(age)
gender_column = df.loc[:,'gender']
gender = gender_column.values
print(gender)

[32 40 16 34 55 40 20 15 55 15]
[0 0 1 1 0 0 1 0 1 0]

In [157]:
arr = [None] * 10
k=0
for i in range(0, 10, 1):
    arr1=age[i]-5
    arr1=arr1*arr1
    arr2=gender[i]-1
    arr2=arr2*arr2
    arr3=arr1+arr2
    arr[k]=math.sqrt(arr3)
    k+=1
print(arr)

[27.018512172212592, 35.014282800023196, 11.0, 29.0, 50.00999900019995, 35.014282800023196, 15.0, 10.04987562112089, 50.0, 10.04987562112089]

In [158]:
MAX = 100000
k=3
temp=[None]*3
def Print3Smallest(arr, n):
    firstmin = MAX
    secmin = MAX
    thirdmin = MAX
 
    for i in range(0, n):
         
        
 
        if arr[i] < firstmin:
            thirdmin = secmin
            secmin = firstmin
            firstmin = arr[i]
 
        
        elif arr[i] < secmin:
            thirdmin = secmin
            secmin = arr[i]
 
       
        elif arr[i] < thirdmin:
            thirdmin = arr[i]
 
    print("First min = ", firstmin)
    print("Second min = ", secmin)
    print("Third min = ", thirdmin)

    temp[0]=firstmin
    temp[1]=secmin
    temp[2]=thirdmin
    print(temp)  
 
n = len(arr)
Print3Smallest(arr, n)

First min =  10.04987562112089
Second min =  10.04987562112089
Third min =  11.0
[10.04987562112089, 10.04987562112089, 11.0]

In [159]:
df.insert(3,'distance',arr,True)
df

      name  age  gender   distance     sport
0     ajay   32       0  27.018512  football
1     mark   40       0  35.014283   neither
2     sara   16       1  11.000000   cricket
3    zaira   34       1  29.000000   cricket
4   sachin   55       0  50.009999   neither
5    rahul   40       0  35.014283   cricket
6    pooja   20       1  15.000000   neither
7    smith   15       0  10.049876   cricket
8    laxmi   55       1  50.000000  football
9  michael   15       0  10.049876  football

In [160]:
df.loc[(df['distance']==temp[0])|(df['distance']==temp[1])|(df['distance']==temp[2])]

      name  age  gender   distance     sport
2     sara   16       1  11.000000   cricket
7    smith   15       0  10.049876   cricket
9  michael   15       0  10.049876  football

In [161]:
a=df['sport'].loc[(df['distance']==temp[0])|(df['distance']==temp[1])|(df['distance']==temp[2])].mode()
a
###Required answer for KNN is the mode

0    cricket
dtype: object

In [162]:
###WEIGHTED KNN

In [163]:
df.loc[(df['distance']==temp[0])|(df['distance']==temp[1])|(df['distance']==temp[2])]

      name  age  gender   distance     sport
2     sara   16       1  11.000000   cricket
7    smith   15       0  10.049876   cricket
9  michael   15       0  10.049876  football

In [164]:
w = [None] * 3
w[0]=1/temp[0]
w[1]=1/temp[1]
w[2]=1/temp[2]
print(w[0])
print(w[1])
print(w[2])

0.09950371902099892
0.09950371902099892
0.09090909090909091

In [165]:
weight=[None]*10
k=0
for i in range(0,10,1):
    weight[k]=1/arr[k]
    k+=1
print(weight)    
df.insert(4,'weight',weight,True)
df

[0.037011660509880265, 0.02855977389887699, 0.09090909090909091, 0.034482758620689655, 0.01999600119960014, 0.02855977389887699, 0.06666666666666667, 0.09950371902099892, 0.02, 0.09950371902099892]

      name  age  gender   distance    weight     sport
0     ajay   32       0  27.018512  0.037012  football
1     mark   40       0  35.014283  0.028560   neither
2     sara   16       1  11.000000  0.090909   cricket
3    zaira   34       1  29.000000  0.034483   cricket
4   sachin   55       0  50.009999  0.019996   neither
5    rahul   40       0  35.014283  0.028560   cricket
6    pooja   20       1  15.000000  0.066667   neither
7    smith   15       0  10.049876  0.099504   cricket
8    laxmi   55       1  50.000000  0.020000  football
9  michael   15       0  10.049876  0.099504  football

In [166]:
df.loc[(df['distance']==temp[0])|(df['distance']==temp[1])|(df['distance']==temp[2])]

      name  age  gender   distance    weight     sport
2     sara   16       1  11.000000  0.090909   cricket
7    smith   15       0  10.049876  0.099504   cricket
9  michael   15       0  10.049876  0.099504  football

In [168]:
array=df.loc[(df['distance']==temp[0])|(df['distance']==temp[1])|(df['distance']==temp[2])].to_numpy()

In [195]:
k=0
sum1=0
sum2=0

for i in range(0,3,1):
    if(array[k][5]=="cricket"):
        sum1+=array[k][4]
        k+=1
    elif(array[k][5]=="football"):
        sum2+=array[k][4] 
        k+=1
        
print("sum of cricket weight",sum1)
print("sum of football weight",sum2)
print(max(sum1,sum2))

sum of cricket weight 0.19041280993008983
sum of football weight 0.09950371902099892
0.19041280993008983

In [196]:
###Sum which has the maximum value is our weighted KNN answer